Tekla Open API Reference for Tekla Structures 2025
BooleanPart.SetOperativePart Method
 Sets the part to operate with. The operative part's class member must be defined to be BooleanOperativeClass.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetOperativePart(
	Part Part
)
Public Function SetOperativePart (
	Part As Part
) As Boolean
Parameters
Part
Type: Tekla.Structures.Model.Part
The operative part for the boolean.
Return Value
Type: Boolean
True on success.
See Also
Reference
BooleanPart Class
Tekla.Structures.Model Namespace